#include <stdio.h>
#include <stdlib.h>
#include <windows.h>
#define MAXLINE 1000 // максимальная длина строки в потоке



int max1; // текущая максимальная длина
int b;
char line1[MAXLINE]; // текущая введёная строка
char longest1[MAXLINE]; // саммая длинная строка из введёных

int getline1(void);
void copy1(void);

int getline(char line1[],int maxline);
void copy(char to[], char from[]);

int getline1(void)
{
    int c, i;
    extern char line1[];

    for (i = 0; i < MAXLINE - 1 && (c = getchar()) != EOF && c != '\n'; ++i)
        line1[i] = c;
    if (c == '\n') {
        line1[i] = c;
        ++i;
    }
    line1[i] = '\0';
    return i;
}

void copy1(void)
{
    int i;
    extern char line1[], longest1[];

    i = 0;
    while ((longest1[i] = line1[i]) != '\0')
        ++i;

}


void del(char s[], int len)
{
    int i, b, w;
    b = 0;
    for (i = 0; i <= len; ++i){ // удаление лишних пробелов
            if (s[i] == ' ')
                ++b;
            else {
                if (b > 1){
                    for (w = i - (b - 1); w <= len; ++w)
                        s[w] = s[w+b-1];
                    len = len - (b - 1);
                    s[w+1] = '\0';
                }

            b = 0;
            }
        }
         printf("\nlen = %d\n", len);
}



void reverse(char s[])
{
    int i,c,d;

    for (i = 0; (c = getchar()) != EOF && c != '\n'; ++i){
        s[i] = c;
        d =  i;
    }
    for (i = d; i >= 0; --i)
        s[i+d+1] = s[d - i];

    for (i = 0; i <= d; ++i){
        s[i] = s[i+d+1];
        s[i+d+1] = 0;
        s[d+1] = '\0';
    }
    printf("%d\n", max1);
}



void copy(char to[], char from[])
{
    int i;
    i = 0;
    while ((to[i] = from[i]) != '\0')
        ++i;
}
int getline(char s[], int lim)
{
    int c, i;
    for (i = 0; i < lim - 1 && (c = getchar()) != EOF && c != '\n'; ++i){
        s[i] = c;
}
    if (c == '\n') {
        s[i] = c;
        ++i;
    }
    s[i] = '\0';
    return i;
}

int power(int base, int n)
{
    int i, p;

    p = 1;
    for(i = 1; i <= n; ++i)
        p = p * base;
    return p;
}
int tempFC(int c)
{
    int f;
    f = (5.0/9.0) * (c-32.0);
    printf("%d", f);

    return f;
}

void start(int p[])
{
    int i, c, po;
    po = 0;
    for(i = 0; i < 10; ++i)
        p[i] = 0;
    while ((c = getchar()) != EOF && c != '\n'){
        if (c >= '0' && c <= '9')
            p[po] = c - '0';
            p[po+1] = 'g';
            po = po + 1;
    }

}

void startG()
{
    printf("ЯЗЫК ПРОГРАМИРОВАНИЯ C(ANSI). БРАЙАН КЕРИГАН ДЕННИС РИТЧИ ГЛАВА 1\n");
    printf("Выберите упражнения из списка. Напишите номер и нажмите Enter для запуска:\n");
    printf("1. Упражнение 1.1. - Привет мир\n2. Упражнение 1.2. - Эксперемент printf \\c \n3. Упражнение 1.3. - Таблица температур(Фаренгейт -> Цельсия) \n4. Упражнение 1.4. - Таблица температур(Цельсия -> Фаренгейт)\n");
    printf("5. Упражнение 1.5. - Таблица температур(обратная).\n6. Упражнение 1.6. - EOF = 1, 0\n7. Упражнение 1.7. - EOF константа \n8. Упражнение 1.8. - Подсчёт символов\n");
    printf("9. Упражнение 1.9. - Замена пробелов\n10. Упражнение 1.10. - Замена управляющих символов\n11. Упражнение 1.11. - Подсчёт слов \n12. Упражнение 1.12. - Вывод по одному\n");
    printf("13. Упражнение 1.13. - Гистограмма длинн слов\n14. Упражнение 1.14. - Гистограмма частот символов\n15. Упражнение 1.15. - Преобразование температур функцией \n16. Упражнение 1.16. - Определение самой длинной строки\n");
    printf("17. Упражнение 1.17. - Вывод только длиннах строк\n18. Упражнение 1.18. - Удаление лишних пробелов и табуляций\n19. Упражнение 1.19. - Функция reverse\n20. Упражнение 1.20. - Замена табуляции на пробелы\n");
    printf("21. Упражнение 1.21. - Замена пробелов на табуляции и пробелы\n22. Упражнение 1.22. - Сворачивание длинных строк\n23. Упражнение 1.23. - Удаление комментариев\n24. Упражнение 1.24. - Примитивная синтаксическая проверка\n");
}

void UP3()
{
int L, up, st;
float f,c;

    L = 0; /* нижняя граница температур */
    up = 300; /* верхняя граница */
    st = 20; /* величина шага */
    printf("Перевод температуры по Фаренгейту в температуру по Цельсию:\n");
    printf("По Фаренгейту\\\По цельсию\n");
    f = L;
    while (f <= up){
        c = (5.0/9.0) * (f-32.0);
        printf("%6.0f\t\t%3.1f\n", f, c);
        f = f + st;
        }
}
void UP4()
{
int L, up, st;
float f, c;

L = 0; /* нижняя граница температур */
up = 300; /* верхняя граница */
st = 20; /* величина шага */
printf("Перевод температуры по Цельсию в температуру по Фаренгейту:\n");
c = L;
    while (c <= up){
        f = (9.0/5.0) * c +32.0;
        printf("%3.0f\t\t%3.0f\n", c, f);
        c=c+st;
        }
}

void UP5()
{
int L, up, st;
float f,c,cf;

    L = 300; /* нижняя граница температур */
    up = 0; /* верхняя граница */
    st = 20; /* величина шага */
    printf("Перевод температуры по Фаренгейту в температуру по Цельсию:\n");
    printf("По Фаренгейту\\\По цельсию\\По Фаренгейту\n");
    f = L;
    while (f >= up){
        c = (5.0/9.0) * (f-32.0);
        cf = (9.0/5.0) * c +32.0;
        printf("%6.0f\t->\t%3.1f\t->\t%3.0f\n", f, c, cf);
        f = f - st;
        }
}
void UP8()
{
    int q, w, e;

    q = w = e = 0;
    while((q=getchar()) != EOF) {
        if (q == ' ')  ++q;
        if (q == '\t') ++w;
        if (q == '\n'){
            ++e;
            break;
        }
    }
    printf("Количество пробелов %d Количество символов табуляции: %d Количество символов конца строки %d\n\n", q, w, e);
}

void UP9()
{
    int c, q;

    q = 0;
    while ((c = getchar()) != EOF){
        if (c == ' ' & q == 0){
            ++q;
            putchar(c);
        }
        if (c != ' '){
            putchar(c);
            q = 0;
        }
    }
}
void UP10()
{
    int c;

    while ((c = getchar()) != EOF){
        if (c =='\t')printf("\\t");
        if (c == 'Backspace') printf("\\b");
        if (c == '/') printf("\\");
        if (c == '\n') break;
        if (c != '\t' && c != 'Backspace' && c != '/' && c != '\n') putchar(c);

    }
}
void UP11()
{

    int q, w, e, c, s;

    s = q = w = e = 0;
    while ((c = getchar()) != EOF) {
        putchar(c);
        ++e;
        if (c == '\n'){
            ++q;
            break;
        }
        if (c == ' ' || c == '\n' || c == '\t')
            s = 0;
        else if (s == 0) {
            s = 1;
            ++w;
        }
    }
    printf("Количество строк: %d \nКоличество слов: %d \nКоличество символов %d\n", q, w, e);
}
void UP12()
{

    int q, w, e, c, s;

    s = q = w = e = 0;
    while ((c = getchar()) != EOF) {
        ++e;
        if (c == '\n'){
            ++q;
            break;
        }
        if (c == ' ' || c == '\n' || c == '\t')
            s = 0;
        else if (s == 0) {
            s = 1;
            ++w;
            printf("\n");
        }

            putchar(c);
    }
    printf("\n\nСтрок: %d \nКоличество слов: %d \nКоличество символов %d\n", q, w, e);
}
void UP13()
{




while (nsymW[i] > 0 ){
        --nsymW[i];
    ignor = nsymW[100] = nword = 0;
    obs = OUT;
    for (i=0; i<=100; ++i)
        nsymW[i] = 0;
    while ((c=getchar()) != EOF && c != '~'){
    if (c == '\t' || c == '\n' || c == ' ')
        obs = OUT;
    else if (obs == OUT){
        ++nword; // количество слов
        obs = IN;
        ++nsymW[nword];
    }
    else
        ++nsymW[nword];
    }
    putchar(c);
    for (i = 1; i <= nword; ++i ){
        printf("%d \t",i);
        if (i == nword)
            printf("\n");
    }

    for (I = 1; I<= 15; ++I){
            printf("\n");
    for (i = 1; i <= nword; ++i ){
        if (nsymW[i] >= I )
        printf(" %3c\t",35);
    }

    }
    printf("\n");
    for (i = 1; i <= nword; ++i )
        printf("%d ",nsymW[i]);
}

int main()
{


    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    int p[MAXLINE];
    extern int max1, b;
    extern char longest1[MAXLINE];
    float c,cq ;
    long nc;
    double ng;
    int C, w, e, nl, nq, nw, ne, m, cc, Cc, CC, W, state, q;
    int ndight, nwhite, nother, nword, nsymW[100], i, obs, ignor, n, I, max;
    int power(int m, int n);
    int len; // длинна текущий строки
    int maxs; // текущая максимальная длинна
    char line[MAXLINE], lineC[MAXLINE]; // текущая введёная строка
    char longest[MAXLINE]; // саммая длинная строка из введёных
    char eight[1000], s[MAXLINE], S[MAXLINE], Tab[8], Tab2[10000];
    int eigh, ce, co, go;

    #define IN 1 // Внутри слова
    #define OUT 0 // Снаружи слова


    startG();
    i = 0;
    while (i<1){
        start(p);
/////////////////////////////////////////////////////////////////////////////////////////////
        if (p[0] == 1 && p[1] == 'g'){
            printf("Упражнение 1.1. Запустите программу \"hello, world\" на выполнение в вашей системе.\nПоэксперементируйте с ней, выбрасывая определённые фрагменты программы и наблюдая за сообщениями об ошибках,\nкоторые будут появлятся в связи с этим.\n");
            printf("Решение:\n");
            printf("hello, ");
            printf("world");
            printf("\n");
            printf("\nДля возврата в оглавление введите 1\n");
            while((c = getchar()) != EOF){
            if (c == '1'){
                startG();
                break;
            }
            if (c != '1' && c == '\n')
                printf("Неправильный ввод. Попробуйте ещё раз.\n");
            }
        }
        else
            printf("Неправильный ввод. Попробуйте ещё раз.\n");
/////////////////////////////////////////////////////////////////////////////////////////////
        if (p[0] == 2 && p[1] == 'g'){
            printf("Упражнение 1.2. Попытайтесь выяснить эксперементально, что происходит при передаче в функцию printf строки,\nсодержащей управляющую последовательность \\с, где c - некий символ, не входящий в вышеперечисленные комбинации. \n");
            printf("Решение:\n");
            printf("1 \\ перед с - \c\n2 \\ перед c - \\c\n3 \\ перед c - \\\c\n1 \\ после c - c\ \n2 \\ после c - c\\ \n3 \\ после c - c\\\ ");
            printf("\nДля возврата в оглавление введите 1\n");
            while((c = getchar()) != EOF){
            if (c == '1'){
                startG();
                break;
            }
            if (c != '1' && c == '\n')
                printf("Неправильный ввод. Попробуйте ещё раз.\n");
            }
        }
        else
            printf("Неправильный ввод. Попробуйте ещё раз.\n");
/////////////////////////////////////////////////////////////////////////////////////////////
        if (p[0] == 3 && p[1] == 'g'){
            printf("Упражнение 1.3. Модифицируйте программу преобразования температур так, чтобы она выводила заголовок над таблицей.\n");
            printf("Решение:\n");
            UP3();
            printf("\nДля возврата в оглавление введите 1\n");
            while((c = getchar()) != EOF){
            if (c == '1'){
                startG();
                break;
            }
            if (c != '1' && c == '\n')
                printf("Неправильный ввод. Попробуйте ещё раз.\n");
            }
        }
        else

/////////////////////////////////////////////////////////////////////////////////////////////
        if (p[0] == 4 && p[1] == 'g'){
            printf("Упражнение 1.4. Напишите программу для перевода температур по Цельсию в шкалу Фаренгейта\nи вывода соответствующей таблицы\n");
            printf("Решение:\n");
            UP4();
            printf("\nДля возврата в оглавление введите 1\n");
            while((c = getchar()) != EOF){
            if (c == '1'){
                startG();
                break;
            }
            if (c != '1' && c == '\n')
                printf("Неправильный ввод. Попробуйте ещё раз.\n");
            }
        }
        else

/////////////////////////////////////////////////////////////////////////////////////////////
        if (p[0] == 5 && p[1] == 'g'){
            printf("Упражнение 1.5. Доработайте программу преобразования температур так, чтобы она выводила таблицу в обратном порядке,\n т.е. от 300 градусов до нуля.\n");
            printf("Решение:\n");
            UP5();
            printf("\nДля возврата в оглавление введите 1\n");
            while((c = getchar()) != EOF){
            if (c == '1'){
                startG();
                break;
            }
            if (c != '1' && c == '\n')
                printf("Неправильный ввод. Попробуйте ещё раз.\n");
            }
        }
        else

/////////////////////////////////////////////////////////////////////////////////////////////
        if (p[0] == 6 && p[1] == 'g'){
            printf("Упражнение 1.6. Проверьте, что выражение getchar() != EOF действительно равно 1 или 0\n");
            printf("Решение:\n");
            printf("Введите текст. При вводе ctrl + shift + z выражение будет равно 0\n");
            printf("(getchar() != EOF) = %d", getchar() != EOF);
            printf("\nДля возврата в оглавление введите 1\n");
            while((c = getchar()) != EOF){
            if (c == '1'){
                startG();
                break;
            }
            if (c != '1' && c == '\n')
                printf("Неправильный ввод. Попробуйте ещё раз.\n");
            }
        }
        else

/////////////////////////////////////////////////////////////////////////////////////////////
if (p[0] == 7 && p[1] == 'g'){
            printf("Упражнение 1.7. Напишите программу для вывода значения EOF\n");
            printf("Решение:\n");
            printf("EOF = %d", EOF);
            printf("\nДля возврата в оглавление введите 1\n");
            while((c = getchar()) != EOF){
            if (c == '1'){
                startG();
                break;
            }
            if (c != '1' && c == '\n')
                printf("Неправильный ввод. Попробуйте ещё раз.\n");
            }
        }
        else

/////////////////////////////////////////////////////////////////////////////////////////////
        if (p[0] == 8 && p[1] == 'g'){
            printf("Упражнение 1.8. Напишите программу для подсчёта пробелов, знаков табуляции и символов конца строки.\n");
            printf("Решение:\n");
            UP8();
            printf("\nДля возврата в оглавление введите 1\n");
            while((c = getchar()) != EOF){
            if (c == '1'){
                startG();
                break;
            }
            if (c != '1' && c == '\n')
                printf("Неправильный ввод. Попробуйте ещё раз.\n");
            }
        }
        else

/////////////////////////////////////////////////////////////////////////////////////////////
        if (p[0] == 9 && p[1] == 'g'){
            printf("Упражнение 1.9. Напишите программу для копирования входного потока в выходной с заменой каждой строки,\nсостоящей из одного или нескольких пробелов, одним пробелом.\n");
            printf("Решение:\n");
            UP9();
            printf("\nДля возврата в оглавление введите 1\n");
            while((c = getchar()) != EOF){
            if (c == '1'){
                startG();
                break;
            }
            if (c != '1' && c == '\n')
                printf("Неправильный ввод. Попробуйте ещё раз.\n");
            }
        }
        else

/////////////////////////////////////////////////////////////////////////////////////////////
        if (p[0] == 1 && p[1] == 0){
            printf("Упражнение 1.10. Напишите программу для копирования входного потока в выходной с заменой знаков табуляции на \\t,\nсимволов возврата назад (backspace) на \\b, а обратных косых чёрт на \\.Это сделает табуляции и символы возврата\nлегко читаемыми в потоке.\n");
            printf("Решение:\n");
            UP10();
            printf("\nДля возврата в оглавление введите 1\n");
            while((c = getchar()) != EOF){
            if (c == '1'){
                startG();
                break;
            }
            if (c != '1' && c == '\n')
                printf("Неправильный ввод. Попробуйте ещё раз.\n");
            }
        }
        else


/////////////////////////////////////////////////////////////////////////////////////////////
        if (p[0] == 1 && p[1] == 1){
            printf("Упражнение 1.11. Как бы вы протестировали программу подсчёта слов? Какого рода входной поток скорее всего выявит ошибки в программе(ели таковые есть)? \n");
            printf("Решение:\n");
            printf("Введите текст включающий в себя отдельные знаки препинания или цифры. В итоге все символы, отделённые пробелами, \nбудут считаться словами. Так же если написать слова разделяя их знаками препинания то эти слова\nбудут считаться как одно\n");
            UP11();
            printf("\nДля возврата в оглавление введите 1\n");
            while((c = getchar()) != EOF){
            if (c == '1'){
                startG();
                break;
            }
            if (c != '1' && c == '\n')
                printf("Неправильный ввод. Попробуйте ещё раз.\n");
            }
        }
        else
            printf("Неправильный ввод. Попробуйте ещё раз.\n");
/////////////////////////////////////////////////////////////////////////////////////////////
        if (p[0] == 1 && p[1] == 2){
            printf("Упражнение 1.12. Напишите программу для вывода входного потока по одному слову в строке\n");
            printf("Решение:\n");
            UP12();
            printf("\nДля возврата в оглавление введите 1\n");
            while((c = getchar()) != EOF){
            if (c == '1'){
                startG();
                break;
            }
            if (c != '1' && c == '\n')
                printf("Неправильный ввод. Попробуйте ещё раз.\n");
            }
        }
        else
            printf("Неправильный ввод. Попробуйте ещё раз.\n");
/////////////////////////////////////////////////////////////////////////////////////////////
        if (p[0] == 1 && p[1] == 3){
            printf("Упражнение 1.13. Напишите программу для вывода гистограммы длинн слов во входном потоке. \nПостроить гистограмму с горизонтальными рядами довольно легко, а вот с вертикальными столбцами труднее.\n");
            printf("Решение:\n");
            UP13();
            printf("\nДля возврата в оглавление введите 1\n");
            while((c = getchar()) != EOF){
            if (c == '1'){
                startG();
                break;
            }
            if (c != '1' && c == '\n')
                printf("Неправильный ввод. Попробуйте ещё раз.\n");
            }
        }
        else
            printf("Неправильный ввод. Попробуйте ещё раз.\n");
/////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////
    }



/*


    printf("Программа для копирования входного потока в выходной с заменом кажой строки\nсостоящей из одного или нескольких пробелов, одним пробелом.\n Для завершения цикла введите ~");
    CC = 0;
    while ((Cc = getchar()) != EOF & Cc != '~'){
        if (Cc == ' ' & CC == 0){
            ++CC;
            putchar(Cc);
        }
        if (Cc != ' '){
            putchar(Cc);
            CC = 0;
        }
    }
    printf("Замена знаков табуляции на \\t, backspace на \\b а обратных косых чёрт - на \\\. Для завершения цикла напишите ~ \n");
    while ((W = getchar()) != EOF & W != '~'){
        if (W =='\t')printf("\\t");
        if (W == 'Backspace') printf("\\b");
        if (W == '/') printf("\\");

    }

    printf("Программа подсчёта строк, слов и символов во входном потоке. Каждое слово выводится на новой строке.\n Введите ~ что бы посмотреть результат\n");

    state = OUT;
    q = nq = nw = ne = 0;
    while ((C = getchar()) != EOF && C != '~') {

        ++ne;
        if (C == '\n')
            ++nq;
        if (C == ' ' || C == '\n' || C == '\t')
            state = OUT;
        else if (state == OUT) {
            state = IN;
            ++nw;
            printf("\n");
            q = 0;
        }

            putchar(C);
    }
    printf("Нажатий Enter: %d Количество слов: %d Количество символов %d\n", nq, nw, ne);
while (nsymW[i] > 0 ){
        --nsymW[i];

   //Напишите программу для вывода гистограммы длин слов во входном потоке.
    ignor = nsymW[100] = nword = 0;
    obs = OUT;
    for (i=0; i<=100; ++i)
        nsymW[i] = 0;
    while ((c=getchar()) != EOF && c != '~'){
    if (c == '\t' || c == '\n' || c == ' ')
        obs = OUT;
    else if (obs == OUT){
        ++nword; // количество слов
        obs = IN;
        ++nsymW[nword];
    }
    else
        ++nsymW[nword];
    }
    putchar(c);
    for (i = 1; i <= nword; ++i ){
        printf("%d \t",i);
        if (i == nword)
            printf("\n");
    }

    for (I = 1; I<= 15; ++I){
            printf("\n");
    for (i = 1; i <= nword; ++i ){
        if (nsymW[i] >= I )
        printf(" %3c\t",35);
    }

    }
    printf("\n");
    for (i = 1; i <= nword; ++i )
        printf("%d ",nsymW[i]);

//  Функция возведения в степень power


    for (i = 0; i < 10; ++i)
        printf("%d %d %d\n", i, power(2,i), power(-3,i));

    tempFC(20);
    printf("\n");
    tempFC(40);
    printf("\n");
    tempFC(60);

    eigh = maxs = 0;
    for (i = 0; i <= 1000; ++i)
                eight[i] = 0;
    while ((len=getline(line, MAXLINE)) > 0){
        printf("Работает len:%d  MAXLINE:%d\n", len, MAXLINE);

        if (len > maxs) {
            maxs = len;
            copy(longest, line);
        }
        if (len > 80)
            printf("Длинна строки больше 80: %s Длинна: %d\n", line, len);
            for (i = 0; i <= len; ++i)
                if (line[i] == '\0')
                    eigh = eigh + i ;
            else   eight[eigh + i] = line[i];


    }
    if (maxs > 0)
        printf("%s", longest);
        printf("Строки длиннее чем 80: %s", eight);



    reverse(s);
    printf("%s", s);



    max1 = 0;
    while ((len = getline1()) > 0)
        if (len > max1) {
            max1 = len;
            copy1();
        }
    if (max1 > 0)
        printf("%s", longest1);

// Программа замены табуляции на пробелы
    for(i = 0; i < 8; ++i)
        Tab[i] = ' ';
    Tab[8] = '\0';
    while((c = getchar()) != EOF && c != '\n')
        if (c == '\t')
            printf("%s", Tab);
    else
        putchar(c);


   // программа замены пробелов на минимальное количество табуляций и дополнительных пробелов

   ce = 0;
    while ((c = getchar()) != EOF && c != '\n')
        if (c == ' ')
            ++ce;
        else if (ce >= 8){
            co = ce/8; // Количество необходимых для замены пробелов /t
            ce = ce - co * 8; // Количество оставшихся пробелов
            for (b = 0; b < co; ++b){
                Tab2[b] = '\t';
                go = b;
            }
            for (i = 0; i < ce; ++i)
                Tab2[b+i] = ' ';
            Tab2[b+i+1] = '\0';
            printf("%s", Tab2);
            ce = 0;
            putchar(c);
        }
        else{
            ce = 0;
            putchar(c);
        }


    b = 0;
    e = 10; // максимум символов на строке
    while ((len = getline(line, MAXLINE))> e){
        del(line, len);
        printf("\nlen = %d\n", len);
        printf("Проверка пробелов\n%s",line);
        w = len / e; // количество переносов
        q = len - w * e;
        printf("w = %d q = %d len = %d", w, q, len);
        copy(lineC, line);
        printf("\n%s%s", line, lineC);
        for (i = 1; i <= w; ++i){
            if (i == 1)
                line[i*e] = '\n';
            else
                line[i*e+(i-1)] = '\n';
            for (b = i*e; b < len; ++b)
            line[b+i] = lineC[b];

        }
        printf("\n%s", line);


    }
}


*/


    return 0;
}








